/* <애니메이션 가이드>

1. 앞으로 N만큼 전진(걷기 애니메이션)
2. 5초 동안 정지(아이들 애니메이션)
3. 왼쪽으로 120도 각도로 회전(걷기 애니메이션)
4. 앞으로 N만큼 전진(걷기 애니메이션)
위 1~3 무한 반복


GPT로 간이 스크립트(NPCPatrol) 작성해서 적용해둠. 편집해서 쓰시거나 새로 작성하셔도 됩니다! 편한대로 써주세요
피아노과 눈송이는 걷지 않고 제자리에서 모션만 출력되도록 해주세요

---

<수정된 FBX파일들>
일반눈송이는 리깅을 완전히 다시했습니다. noonsong remake 0202.fbx 파일을 사용해주세요
애니메이션 적용 중, 리깅이 잘못된 전공눈송이들을 조금 수정했습니다.
수정된 FBX파일을 사용해주세요
수정된 파일은 파일명에 '(전공명) fix'라고 되어있습니다

[이번에 수정된 전공눈송이]
01_Korean Language
07_Information
12_Biological
15_Physical Edu
18_AI
20_Physics
23_Mechanic
25_Family
26_Child
35_Economics
37_Piano
40_Composition
41_Pharmacy
47_Global

*참고) 중국어문 눈송이는 예전에 수정한 버전입니다


일반눈송이는 전신 리깅이 되어있고 전공눈송이는 몸통과 다리만 리깅되어있습니다
둘이 사용하는 애니메이션이 다르니 올바르게 사용해주세요
모든 전공눈송이들은 같은 애니메이터,애니메이션 클립을 사용합니다
하지만 아마추어 이름(Armature.028)이 다르면 적용되지 않으니 주의해주세요

---
<그 외>

- 일반눈송이의 배에 있던 S로고는 원래 폴리곤으로 표현했으나 애니메이션이 적용되면서 부자연스러워져 텍스쳐로 그렸습니다 
- 기존에는 전공눈송이 별로 메테리얼이 새로 생성되어 중복되는 메테리얼 파일이 많았는데 이번에 메테리얼 임포트 방식을 바꿔서 쓸데없는 파일 수를 확 줄였습니다 ^^V
*/